
 /----------------------------------------------------------------------------\
 |                                                                            |
 |  yosys -- Yosys Open SYnthesis Suite                                       |
 |                                                                            |
 |  Copyright (C) 2012 - 2020  Claire Xenia Wolf <claire@yosyshq.com>         |
 |                                                                            |
 |  Permission to use, copy, modify, and/or distribute this software for any  |
 |  purpose with or without fee is hereby granted, provided that the above    |
 |  copyright notice and this permission notice appear in all copies.         |
 |                                                                            |
 |  THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES  |
 |  WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF          |
 |  MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR   |
 |  ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES    |
 |  WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN     |
 |  ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF   |
 |  OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.            |
 |                                                                            |
 \----------------------------------------------------------------------------/

 Yosys 0.27+22 (git sha1 53c0a6b78, clang 10.0.0-4ubuntu1 -fPIC -Os)

echo on

yosys> read_verilog -sv inputs/serv_top.v

1. Executing Verilog-2005 frontend: inputs/serv_top.v
Parsing SystemVerilog input from `inputs/serv_top.v' to AST representation.
Generating RTLIL representation for module `\serv_top'.
Generating RTLIL representation for module `\serv_alu'.
Generating RTLIL representation for module `\serv_bufreg'.
Generating RTLIL representation for module `\serv_bufreg2'.
Generating RTLIL representation for module `\serv_csr'.
Generating RTLIL representation for module `\serv_ctrl'.
Generating RTLIL representation for module `\serv_decode'.
Generating RTLIL representation for module `\serv_immdec'.
Generating RTLIL representation for module `\serv_mem_if'.
Generating RTLIL representation for module `\serv_rf_if'.
Generating RTLIL representation for module `\serv_state'.
Successfully finished Verilog frontend.

yosys> chparam -list
serv_state:
  RESET_STRATEGY
  WITH_CSR
  ALIGN
  MDU
serv_rf_if:
  WITH_CSR
serv_mem_if:
  WITH_CSR
serv_immdec:
  SHARED_RFADDR_IMM_REGS
serv_decode:
  PRE_REGISTER
  MDU
serv_ctrl:
  RESET_STRATEGY
  RESET_PC
  WITH_CSR
serv_csr:
  RESET_STRATEGY
serv_bufreg2:
serv_bufreg:
  MDU
serv_alu:
serv_top:
  WITH_CSR
  PRE_REGISTER
  RESET_STRATEGY
  RESET_PC
  MDU
  COMPRESSED
  ALIGN

yosys> read_liberty -lib inputs/sc_logiclib_sky130hd_sky130_fd_sc_hd__ss_n40C_1v40.lib.lib

2. Executing Liberty frontend: inputs/sc_logiclib_sky130hd_sky130_fd_sc_hd__ss_n40C_1v40.lib.lib
Imported 428 cell types from liberty file.

yosys> hierarchy -top serv_top

3. Executing HIERARCHY pass (managing design hierarchy).

3.1. Analyzing design hierarchy..
Top module:  \serv_top
Used module:     \serv_csr
Used module:     \serv_mem_if
Used module:     \serv_rf_if
Used module:     \serv_alu
Used module:     \serv_ctrl
Used module:     \serv_bufreg2
Used module:     \serv_bufreg
Used module:     \serv_immdec
Used module:     \serv_decode
Used module:     \serv_state
Parameter \RESET_STRATEGY = 1296649801

3.2. Executing AST frontend in derive mode using pre-parsed AST for module `\serv_csr'.
Parameter \RESET_STRATEGY = 1296649801
Generating RTLIL representation for module `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001'.
Parameter \WITH_CSR = 1'1

3.3. Executing AST frontend in derive mode using pre-parsed AST for module `\serv_mem_if'.
Parameter \WITH_CSR = 1'1
Generating RTLIL representation for module `$paramod\serv_mem_if\WITH_CSR=1'1'.
Parameter \WITH_CSR = 1

3.4. Executing AST frontend in derive mode using pre-parsed AST for module `\serv_rf_if'.
Parameter \WITH_CSR = 1
Generating RTLIL representation for module `$paramod\serv_rf_if\WITH_CSR=s32'00000000000000000000000000000001'.
Parameter \RESET_STRATEGY = 1296649801
Parameter \RESET_PC = 0
Parameter \WITH_CSR = 1

3.5. Executing AST frontend in derive mode using pre-parsed AST for module `\serv_ctrl'.
Parameter \RESET_STRATEGY = 1296649801
Parameter \RESET_PC = 0
Parameter \WITH_CSR = 1
Generating RTLIL representation for module `$paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl'.
Parameter \MDU = 1'0

3.6. Executing AST frontend in derive mode using pre-parsed AST for module `\serv_bufreg'.
Parameter \MDU = 1'0
Generating RTLIL representation for module `$paramod\serv_bufreg\MDU=1'0'.
Parameter \PRE_REGISTER = 1
Parameter \MDU = 1'0

3.7. Executing AST frontend in derive mode using pre-parsed AST for module `\serv_decode'.
Parameter \PRE_REGISTER = 1
Parameter \MDU = 1'0
Generating RTLIL representation for module `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0'.
Parameter \RESET_STRATEGY = 1296649801
Parameter \WITH_CSR = 1'1
Parameter \ALIGN = 1'0
Parameter \MDU = 1'0

3.8. Executing AST frontend in derive mode using pre-parsed AST for module `\serv_state'.
Parameter \RESET_STRATEGY = 1296649801
Parameter \WITH_CSR = 1'1
Parameter \ALIGN = 1'0
Parameter \MDU = 1'0
Generating RTLIL representation for module `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state'.

3.9. Analyzing design hierarchy..
Top module:  \serv_top
Used module:     $paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001
Used module:     $paramod\serv_mem_if\WITH_CSR=1'1
Used module:     $paramod\serv_rf_if\WITH_CSR=s32'00000000000000000000000000000001
Used module:     \serv_alu
Used module:     $paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl
Used module:     \serv_bufreg2
Used module:     $paramod\serv_bufreg\MDU=1'0
Used module:     \serv_immdec
Used module:     $paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0
Used module:     $paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state

3.10. Analyzing design hierarchy..
Top module:  \serv_top
Used module:     $paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001
Used module:     $paramod\serv_mem_if\WITH_CSR=1'1
Used module:     $paramod\serv_rf_if\WITH_CSR=s32'00000000000000000000000000000001
Used module:     \serv_alu
Used module:     $paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl
Used module:     \serv_bufreg2
Used module:     $paramod\serv_bufreg\MDU=1'0
Used module:     \serv_immdec
Used module:     $paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0
Used module:     $paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state
Removing unused module `\serv_state'.
Removing unused module `\serv_rf_if'.
Removing unused module `\serv_mem_if'.
Removing unused module `\serv_decode'.
Removing unused module `\serv_ctrl'.
Removing unused module `\serv_csr'.
Removing unused module `\serv_bufreg'.
Removed 7 unused modules.

yosys> synth -flatten -top serv_top

4. Executing SYNTH pass.

yosys> hierarchy -check -top serv_top

4.1. Executing HIERARCHY pass (managing design hierarchy).

4.1.1. Analyzing design hierarchy..
Top module:  \serv_top
Used module:     $paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001
Used module:     $paramod\serv_mem_if\WITH_CSR=1'1
Used module:     $paramod\serv_rf_if\WITH_CSR=s32'00000000000000000000000000000001
Used module:     \serv_alu
Used module:     $paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl
Used module:     \serv_bufreg2
Used module:     $paramod\serv_bufreg\MDU=1'0
Used module:     \serv_immdec
Used module:     $paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0
Used module:     $paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state

4.1.2. Analyzing design hierarchy..
Top module:  \serv_top
Used module:     $paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001
Used module:     $paramod\serv_mem_if\WITH_CSR=1'1
Used module:     $paramod\serv_rf_if\WITH_CSR=s32'00000000000000000000000000000001
Used module:     \serv_alu
Used module:     $paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl
Used module:     \serv_bufreg2
Used module:     $paramod\serv_bufreg\MDU=1'0
Used module:     \serv_immdec
Used module:     $paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0
Used module:     $paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state
Removed 0 unused modules.

yosys> proc

4.2. Executing PROC pass (convert processes to netlists).

yosys> proc_clean

4.2.1. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Found and cleaned up 1 empty switch in `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1945$888'.
Found and cleaned up 1 empty switch in `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1876$864'.
Found and cleaned up 1 empty switch in `$paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.$proc$inputs/serv_top.v:0$640'.
Removing empty process `$paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.$proc$inputs/serv_top.v:0$640'.
Found and cleaned up 1 empty switch in `$paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.$proc$inputs/serv_top.v:1061$631'.
Found and cleaned up 1 empty switch in `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.$proc$inputs/serv_top.v:923$505'.
Cleaned up 5 empty switches.

yosys> proc_rmdead

4.2.2. Executing PROC_RMDEAD pass (remove dead branches from decision trees).
Removed a total of 0 dead cases.

yosys> proc_prune

4.2.3. Executing PROC_PRUNE pass (remove redundant assignments in processes).
Removed 0 redundant assignments.
Promoted 49 assignments to connections.

yosys> proc_init

4.2.4. Executing PROC_INIT pass (extract init attributes).

yosys> proc_arst

4.2.5. Executing PROC_ARST pass (detect async resets in processes).

yosys> proc_rom

4.2.6. Executing PROC_ROM pass (convert switches to ROMs).
Converted 0 switches.
<suppressed ~25 debug messages>

yosys> proc_mux

4.2.7. Executing PROC_MUX pass (convert decision trees to multiplexers).
Creating decoders for process `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1945$888'.
     1/1: $0\genblk1.misalign_trap_sync_r[0:0]
Creating decoders for process `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1876$864'.
     1/7: $0\o_cnt_r[3:0]
     2/7: $0\o_cnt[2:0]
     3/7: $0\stage_two_req[0:0]
     4/7: $0\o_cnt_done[0:0]
     5/7: $0\ibus_cyc[0:0]
     6/7: $0\init_done[0:0]
     7/7: $0\o_ctrl_jump[0:0]
Creating decoders for process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
Creating decoders for process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1312$801'.
     1/8: $0\imm30[0:0]
     2/8: $0\imm25[0:0]
     3/8: $0\op26[0:0]
     4/8: $0\op22[0:0]
     5/8: $0\op21[0:0]
     6/8: $0\op20[0:0]
     7/8: $0\funct3[2:0]
     8/8: $0\opcode[4:0]
Creating decoders for process `$paramod\serv_bufreg\MDU=1'0.$proc$inputs/serv_top.v:764$648'.
     1/2: $0\data[29:0]
     2/2: $0\lsb[1:0]
Creating decoders for process `\serv_immdec.$proc$inputs/serv_top.v:1481$305'.
     1/6: $0\imm11_7[4:0]
     2/6: $0\imm24_20[4:0]
     3/6: $0\imm30_25[5:0]
     4/6: $0\imm7[0:0]
     5/6: $0\imm19_12_20[8:0]
     6/6: $0\imm31[0:0]
Creating decoders for process `$paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.$proc$inputs/serv_top.v:1061$631'.
     1/1: $0\o_ibus_adr[31:0]
Creating decoders for process `$paramod\serv_mem_if\WITH_CSR=1'1.$proc$inputs/serv_top.v:1589$584'.
     1/1: $0\signbit[0:0]
Creating decoders for process `\serv_bufreg2.$proc$inputs/serv_top.v:841$68'.
     1/1: $0\dat[31:0]
Creating decoders for process `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.$proc$inputs/serv_top.v:923$505'.
     1/10: $0\mcause3_0[3:0] [1]
     2/10: $0\mcause3_0[3:0] [0]
     3/10: $0\mcause3_0[3:0] [2]
     4/10: $0\mcause3_0[3:0] [3]
     5/10: $0\timer_irq_r[0:0]
     6/10: $0\mcause31[0:0]
     7/10: $0\mie_mtie[0:0]
     8/10: $0\mstatus_mpie[0:0]
     9/10: $0\mstatus_mie[0:0]
    10/10: $0\o_new_irq[0:0]
Creating decoders for process `\serv_alu.$proc$inputs/serv_top.v:721$28'.
     1/1: $0\cmp_r[0:0]

yosys> proc_dlatch

4.2.8. Executing PROC_DLATCH pass (convert process syncs to latches).
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_ext_funct3' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_bne_or_bge' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_cond_branch' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_dbus_en' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_e_op' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_ebreak' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_branch_op' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_shift_op' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_slt_or_branch' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_rd_op' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_sh_right' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_mdu_op' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_two_stage_op' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_bufreg_rs1_en' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_bufreg_imm_en' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_bufreg_clr_lsb' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_bufreg_sh_signed' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_op_b_source' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_ctrl_jal_or_jalr' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_ctrl_utype' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_ctrl_pc_rel' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_ctrl_mret' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_alu_sub' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_alu_bool_op' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_alu_cmp_eq' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_alu_cmp_sig' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_alu_rd_sel' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_mem_cmd' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_mem_signed' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_mem_word' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_mem_half' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_csr_en' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_csr_addr' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_csr_mstatus_en' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_csr_mie_en' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_csr_mcause_en' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_csr_source' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_csr_d_sel' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_csr_imm_en' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_mtval_pc' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_immdec_ctrl' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_immdec_en' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_rd_mem_en' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_rd_csr_en' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
No latch inferred for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\o_rd_alu_en' from process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.

yosys> proc_dff

4.2.9. Executing PROC_DFF pass (convert process syncs to FFs).
Creating register for signal `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.\genblk1.misalign_trap_sync_r' using process `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1945$888'.
  created $dff cell `$procdff$976' with positive edge clock.
Creating register for signal `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.\o_cnt_done' using process `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1876$864'.
  created $dff cell `$procdff$977' with positive edge clock.
Creating register for signal `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.\o_ctrl_jump' using process `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1876$864'.
  created $dff cell `$procdff$978' with positive edge clock.
Creating register for signal `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.\stage_two_req' using process `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1876$864'.
  created $dff cell `$procdff$979' with positive edge clock.
Creating register for signal `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.\init_done' using process `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1876$864'.
  created $dff cell `$procdff$980' with positive edge clock.
Creating register for signal `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.\o_cnt' using process `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1876$864'.
  created $dff cell `$procdff$981' with positive edge clock.
Creating register for signal `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.\o_cnt_r' using process `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1876$864'.
  created $dff cell `$procdff$982' with positive edge clock.
Creating register for signal `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.\ibus_cyc' using process `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1876$864'.
  created $dff cell `$procdff$983' with positive edge clock.
Creating register for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\opcode' using process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1312$801'.
  created $dff cell `$procdff$984' with positive edge clock.
Creating register for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\funct3' using process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1312$801'.
  created $dff cell `$procdff$985' with positive edge clock.
Creating register for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\op20' using process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1312$801'.
  created $dff cell `$procdff$986' with positive edge clock.
Creating register for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\op21' using process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1312$801'.
  created $dff cell `$procdff$987' with positive edge clock.
Creating register for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\op22' using process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1312$801'.
  created $dff cell `$procdff$988' with positive edge clock.
Creating register for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\op26' using process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1312$801'.
  created $dff cell `$procdff$989' with positive edge clock.
Creating register for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\imm25' using process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1312$801'.
  created $dff cell `$procdff$990' with positive edge clock.
Creating register for signal `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.\imm30' using process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1312$801'.
  created $dff cell `$procdff$991' with positive edge clock.
Creating register for signal `$paramod\serv_bufreg\MDU=1'0.\lsb' using process `$paramod\serv_bufreg\MDU=1'0.$proc$inputs/serv_top.v:764$648'.
  created $dff cell `$procdff$992' with positive edge clock.
Creating register for signal `$paramod\serv_bufreg\MDU=1'0.\c_r' using process `$paramod\serv_bufreg\MDU=1'0.$proc$inputs/serv_top.v:764$648'.
  created $dff cell `$procdff$993' with positive edge clock.
Creating register for signal `$paramod\serv_bufreg\MDU=1'0.\data' using process `$paramod\serv_bufreg\MDU=1'0.$proc$inputs/serv_top.v:764$648'.
  created $dff cell `$procdff$994' with positive edge clock.
Creating register for signal `\serv_immdec.\imm31' using process `\serv_immdec.$proc$inputs/serv_top.v:1481$305'.
  created $dff cell `$procdff$995' with positive edge clock.
Creating register for signal `\serv_immdec.\imm19_12_20' using process `\serv_immdec.$proc$inputs/serv_top.v:1481$305'.
  created $dff cell `$procdff$996' with positive edge clock.
Creating register for signal `\serv_immdec.\imm7' using process `\serv_immdec.$proc$inputs/serv_top.v:1481$305'.
  created $dff cell `$procdff$997' with positive edge clock.
Creating register for signal `\serv_immdec.\imm30_25' using process `\serv_immdec.$proc$inputs/serv_top.v:1481$305'.
  created $dff cell `$procdff$998' with positive edge clock.
Creating register for signal `\serv_immdec.\imm24_20' using process `\serv_immdec.$proc$inputs/serv_top.v:1481$305'.
  created $dff cell `$procdff$999' with positive edge clock.
Creating register for signal `\serv_immdec.\imm11_7' using process `\serv_immdec.$proc$inputs/serv_top.v:1481$305'.
  created $dff cell `$procdff$1000' with positive edge clock.
Creating register for signal `$paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.\o_ibus_adr' using process `$paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.$proc$inputs/serv_top.v:1061$631'.
  created $dff cell `$procdff$1001' with positive edge clock.
Creating register for signal `$paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.\pc_plus_4_cy_r' using process `$paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.$proc$inputs/serv_top.v:1061$631'.
  created $dff cell `$procdff$1002' with positive edge clock.
Creating register for signal `$paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.\pc_plus_offset_cy_r' using process `$paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.$proc$inputs/serv_top.v:1061$631'.
  created $dff cell `$procdff$1003' with positive edge clock.
Creating register for signal `$paramod\serv_mem_if\WITH_CSR=1'1.\signbit' using process `$paramod\serv_mem_if\WITH_CSR=1'1.$proc$inputs/serv_top.v:1589$584'.
  created $dff cell `$procdff$1004' with positive edge clock.
Creating register for signal `\serv_bufreg2.\dat' using process `\serv_bufreg2.$proc$inputs/serv_top.v:841$68'.
  created $dff cell `$procdff$1005' with positive edge clock.
Creating register for signal `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.\o_new_irq' using process `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.$proc$inputs/serv_top.v:923$505'.
  created $dff cell `$procdff$1006' with positive edge clock.
Creating register for signal `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.\mstatus_mie' using process `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.$proc$inputs/serv_top.v:923$505'.
  created $dff cell `$procdff$1007' with positive edge clock.
Creating register for signal `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.\mstatus_mpie' using process `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.$proc$inputs/serv_top.v:923$505'.
  created $dff cell `$procdff$1008' with positive edge clock.
Creating register for signal `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.\mie_mtie' using process `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.$proc$inputs/serv_top.v:923$505'.
  created $dff cell `$procdff$1009' with positive edge clock.
Creating register for signal `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.\mcause31' using process `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.$proc$inputs/serv_top.v:923$505'.
  created $dff cell `$procdff$1010' with positive edge clock.
Creating register for signal `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.\mcause3_0' using process `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.$proc$inputs/serv_top.v:923$505'.
  created $dff cell `$procdff$1011' with positive edge clock.
Creating register for signal `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.\timer_irq_r' using process `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.$proc$inputs/serv_top.v:923$505'.
  created $dff cell `$procdff$1012' with positive edge clock.
Creating register for signal `\serv_alu.\cmp_r' using process `\serv_alu.$proc$inputs/serv_top.v:721$28'.
  created $dff cell `$procdff$1013' with positive edge clock.
Creating register for signal `\serv_alu.\add_cy_r' using process `\serv_alu.$proc$inputs/serv_top.v:721$28'.
  created $dff cell `$procdff$1014' with positive edge clock.

yosys> proc_memwr

4.2.10. Executing PROC_MEMWR pass (convert process memory writes to cells).

yosys> proc_clean

4.2.11. Executing PROC_CLEAN pass (remove empty switches from decision trees).
Found and cleaned up 2 empty switches in `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1945$888'.
Removing empty process `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1945$888'.
Found and cleaned up 3 empty switches in `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1876$864'.
Removing empty process `$paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.$proc$inputs/serv_top.v:1876$864'.
Removing empty process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1325$802'.
Found and cleaned up 1 empty switch in `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1312$801'.
Removing empty process `$paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.$proc$inputs/serv_top.v:1312$801'.
Found and cleaned up 2 empty switches in `$paramod\serv_bufreg\MDU=1'0.$proc$inputs/serv_top.v:764$648'.
Removing empty process `$paramod\serv_bufreg\MDU=1'0.$proc$inputs/serv_top.v:764$648'.
Found and cleaned up 6 empty switches in `\serv_immdec.$proc$inputs/serv_top.v:1481$305'.
Removing empty process `serv_immdec.$proc$inputs/serv_top.v:1481$305'.
Found and cleaned up 1 empty switch in `$paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.$proc$inputs/serv_top.v:1061$631'.
Removing empty process `$paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.$proc$inputs/serv_top.v:1061$631'.
Found and cleaned up 1 empty switch in `$paramod\serv_mem_if\WITH_CSR=1'1.$proc$inputs/serv_top.v:1589$584'.
Removing empty process `$paramod\serv_mem_if\WITH_CSR=1'1.$proc$inputs/serv_top.v:1589$584'.
Found and cleaned up 1 empty switch in `\serv_bufreg2.$proc$inputs/serv_top.v:841$68'.
Removing empty process `serv_bufreg2.$proc$inputs/serv_top.v:841$68'.
Found and cleaned up 7 empty switches in `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.$proc$inputs/serv_top.v:923$505'.
Removing empty process `$paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.$proc$inputs/serv_top.v:923$505'.
Found and cleaned up 1 empty switch in `\serv_alu.$proc$inputs/serv_top.v:721$28'.
Removing empty process `serv_alu.$proc$inputs/serv_top.v:721$28'.
Cleaned up 25 empty switches.

yosys> opt_expr -keepdc

4.2.12. Executing OPT_EXPR pass (perform const folding).
Optimizing module $paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.
<suppressed ~13 debug messages>
Optimizing module $paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.
<suppressed ~17 debug messages>
Optimizing module $paramod\serv_bufreg\MDU=1'0.
<suppressed ~2 debug messages>
Optimizing module serv_immdec.
Optimizing module $paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.
Optimizing module $paramod\serv_rf_if\WITH_CSR=s32'00000000000000000000000000000001.
<suppressed ~1 debug messages>
Optimizing module $paramod\serv_mem_if\WITH_CSR=1'1.
<suppressed ~3 debug messages>
Optimizing module serv_bufreg2.
<suppressed ~1 debug messages>
Optimizing module $paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.
<suppressed ~1 debug messages>
Optimizing module serv_alu.
Optimizing module serv_top.

yosys> flatten

4.3. Executing FLATTEN pass (flatten design).
Deleting now unused module $paramod$5bc254ad4a50c9139a1e42c07db4c2881223315e\serv_state.
Deleting now unused module $paramod\serv_decode\PRE_REGISTER=s32'00000000000000000000000000000001\MDU=1'0.
Deleting now unused module $paramod\serv_bufreg\MDU=1'0.
Deleting now unused module serv_immdec.
Deleting now unused module $paramod$1ef5ccfc2bac446e983c1fd8480731f1af2867c1\serv_ctrl.
Deleting now unused module $paramod\serv_rf_if\WITH_CSR=s32'00000000000000000000000000000001.
Deleting now unused module $paramod\serv_mem_if\WITH_CSR=1'1.
Deleting now unused module serv_bufreg2.
Deleting now unused module $paramod\serv_csr\RESET_STRATEGY=t32'01001101010010010100111001001001.
Deleting now unused module serv_alu.
<suppressed ~10 debug messages>

yosys> opt_expr

4.4. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.
<suppressed ~3 debug messages>

yosys> opt_clean

4.5. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..
Removed 5 unused cells and 269 unused wires.
<suppressed ~7 debug messages>

yosys> check

4.6. Executing CHECK pass (checking for obvious problems).
Checking module serv_top...
Found and reported 0 problems.

yosys> opt -nodffe -nosdff

4.7. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.7.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

yosys> opt_merge -nomux

4.7.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
<suppressed ~207 debug messages>
Removed a total of 69 cells.

yosys> opt_muxtree

4.7.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \serv_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~53 debug messages>

yosys> opt_reduce

4.7.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \serv_top.
Performed a total of 0 changes.

yosys> opt_merge

4.7.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

4.7.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.7.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..
Removed 0 unused cells and 69 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

4.7.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

4.7.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.7.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \serv_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~53 debug messages>

yosys> opt_reduce

4.7.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \serv_top.
Performed a total of 0 changes.

yosys> opt_merge

4.7.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_dff -nodffe -nosdff

4.7.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.7.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..

yosys> opt_expr

4.7.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

4.7.16. Finished OPT passes. (There is nothing left to do.)

yosys> fsm

4.8. Executing FSM pass (extract and optimize FSM).

yosys> fsm_detect

4.8.1. Executing FSM_DETECT pass (finding FSMs in design).

yosys> fsm_extract

4.8.2. Executing FSM_EXTRACT pass (extracting FSM from design).

yosys> fsm_opt

4.8.3. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> opt_clean

4.8.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..

yosys> fsm_opt

4.8.5. Executing FSM_OPT pass (simple optimizations of FSMs).

yosys> fsm_recode

4.8.6. Executing FSM_RECODE pass (re-assigning FSM state encoding).

yosys> fsm_info

4.8.7. Executing FSM_INFO pass (dumping all available information on FSM cells).

yosys> fsm_map

4.8.8. Executing FSM_MAP pass (mapping FSMs to basic logic).

yosys> opt

4.9. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.9.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

yosys> opt_merge -nomux

4.9.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

4.9.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \serv_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~53 debug messages>

yosys> opt_reduce

4.9.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \serv_top.
Performed a total of 0 changes.

yosys> opt_merge

4.9.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_dff

4.9.6. Executing OPT_DFF pass (perform DFF optimizations).
Adding EN signal on $flatten\state.$procdff$983 ($dff) from module serv_top (D = $flatten\ctrl.$or$inputs/serv_top.v:1069$634_Y, Q = \state.ibus_cyc).
Adding SRST signal on $flatten\state.$procdff$982 ($dff) from module serv_top (D = { \state.o_cnt_r [2:0] $flatten\state.$or$inputs/serv_top.v:1921$879_Y }, Q = \state.o_cnt_r, rval = 4'0000).
Adding SRST signal on $flatten\state.$procdff$981 ($dff) from module serv_top (D = $flatten\state.$add$inputs/serv_top.v:1920$874_Y, Q = \state.o_cnt, rval = 3'000).
Adding SRST signal on $flatten\state.$procdff$980 ($dff) from module serv_top (D = $flatten\state.$procmux$904_Y, Q = \state.init_done, rval = 1'0).
Adding EN signal on $auto$ff.cc:266:slice$1018 ($sdff) from module serv_top (D = $flatten\state.$and$inputs/serv_top.v:1890$869_Y, Q = \state.init_done).
Adding SRST signal on $flatten\state.$procdff$979 ($dff) from module serv_top (D = $flatten\state.$and$inputs/serv_top.v:1896$873_Y, Q = \state.stage_two_req, rval = 1'0).
Adding SRST signal on $flatten\state.$procdff$978 ($dff) from module serv_top (D = $flatten\state.$procmux$908_Y, Q = \state.o_ctrl_jump, rval = 1'0).
Adding EN signal on $auto$ff.cc:266:slice$1021 ($sdff) from module serv_top (D = $flatten\state.$and$inputs/serv_top.v:1891$870_Y, Q = \state.o_ctrl_jump).
Adding SRST signal on $flatten\state.$procdff$977 ($dff) from module serv_top (D = $flatten\state.$and$inputs/serv_top.v:1893$872_Y, Q = \state.o_cnt_done, rval = 1'0).
Adding SRST signal on $flatten\state.$procdff$976 ($dff) from module serv_top (D = $flatten\state.$procmux$890_Y, Q = \state.genblk1.misalign_trap_sync_r, rval = 1'0).
Adding EN signal on $auto$ff.cc:266:slice$1024 ($sdff) from module serv_top (D = $flatten\state.$and$inputs/serv_top.v:1947$889_Y, Q = \state.genblk1.misalign_trap_sync_r).
Adding EN signal on $flatten\mem_if.$procdff$1004 ($dff) from module serv_top (D = \mem_if.i_bufreg2_q, Q = \mem_if.signbit).
Adding EN signal on $flatten\immdec.$procdff$999 ($dff) from module serv_top (D = $flatten\immdec.$ternary$inputs/serv_top.v:1495$319_Y, Q = \immdec.imm24_20).
Adding EN signal on $flatten\immdec.$procdff$998 ($dff) from module serv_top (D = $flatten\immdec.$ternary$inputs/serv_top.v:1492$316_Y, Q = \immdec.imm30_25).
Adding EN signal on $flatten\immdec.$procdff$997 ($dff) from module serv_top (D = $flatten\immdec.$ternary$inputs/serv_top.v:1489$311_Y, Q = \immdec.imm7).
Adding EN signal on $flatten\immdec.$procdff$996 ($dff) from module serv_top (D = $flatten\immdec.$ternary$inputs/serv_top.v:1487$309_Y, Q = \immdec.imm19_12_20).
Adding EN signal on $flatten\immdec.$procdff$995 ($dff) from module serv_top (D = \i_ibus_rdt [31], Q = \immdec.imm31).
Adding EN signal on $flatten\immdec.$procdff$1000 ($dff) from module serv_top (D = $flatten\immdec.$ternary$inputs/serv_top.v:1498$322_Y, Q = \immdec.imm11_7).
Adding EN signal on $flatten\genblk3.csr.$procdff$1012 ($dff) from module serv_top (D = \genblk3.csr.timer_irq, Q = \genblk3.csr.timer_irq_r).
Adding EN signal on $flatten\genblk3.csr.$procdff$1011 ($dff) from module serv_top (D = { $flatten\genblk3.csr.$or$inputs/serv_top.v:975$527_Y $flatten\genblk3.csr.$or$inputs/serv_top.v:976$531_Y $flatten\genblk3.csr.$or$inputs/serv_top.v:977$537_Y $flatten\genblk3.csr.$or$inputs/serv_top.v:978$541_Y }, Q = \genblk3.csr.mcause3_0).
Adding EN signal on $flatten\genblk3.csr.$procdff$1010 ($dff) from module serv_top (D = $flatten\genblk3.csr.$ternary$inputs/serv_top.v:981$544_Y, Q = \genblk3.csr.mcause31).
Adding SRST signal on $flatten\genblk3.csr.$procdff$1009 ($dff) from module serv_top (D = $flatten\genblk3.csr.$procmux$962_Y, Q = \genblk3.csr.mie_mtie, rval = 1'0).
Adding EN signal on $auto$ff.cc:266:slice$1036 ($sdff) from module serv_top (D = \genblk3.csr.csr_in, Q = \genblk3.csr.mie_mtie).
Adding EN signal on $flatten\genblk3.csr.$procdff$1008 ($dff) from module serv_top (D = \genblk3.csr.mstatus_mie, Q = \genblk3.csr.mstatus_mpie).
Adding EN signal on $flatten\genblk3.csr.$procdff$1007 ($dff) from module serv_top (D = $flatten\genblk3.csr.$and$inputs/serv_top.v:943$517_Y, Q = \genblk3.csr.mstatus_mie).
Adding SRST signal on $flatten\genblk3.csr.$procdff$1006 ($dff) from module serv_top (D = $flatten\genblk3.csr.$procmux$970_Y, Q = \genblk3.csr.o_new_irq, rval = 1'0).
Adding EN signal on $auto$ff.cc:266:slice$1040 ($sdff) from module serv_top (D = $flatten\genblk3.csr.$and$inputs/serv_top.v:926$509_Y, Q = \genblk3.csr.o_new_irq).
Adding EN signal on $flatten\decode.$procdff$991 ($dff) from module serv_top (D = \i_ibus_rdt [30], Q = \decode.imm30).
Adding EN signal on $flatten\decode.$procdff$989 ($dff) from module serv_top (D = \i_ibus_rdt [26], Q = \decode.op26).
Adding EN signal on $flatten\decode.$procdff$988 ($dff) from module serv_top (D = \i_ibus_rdt [22], Q = \decode.op22).
Adding EN signal on $flatten\decode.$procdff$987 ($dff) from module serv_top (D = \i_ibus_rdt [21], Q = \decode.op21).
Adding EN signal on $flatten\decode.$procdff$986 ($dff) from module serv_top (D = \i_ibus_rdt [20], Q = \decode.op20).
Adding EN signal on $flatten\decode.$procdff$985 ($dff) from module serv_top (D = \i_ibus_rdt [14:12], Q = \decode.funct3).
Adding EN signal on $flatten\decode.$procdff$984 ($dff) from module serv_top (D = \i_ibus_rdt [6:2], Q = \decode.opcode).
Adding EN signal on $flatten\ctrl.$procdff$1001 ($dff) from module serv_top (D = $flatten\ctrl.$ternary$inputs/serv_top.v:1070$635_Y, Q = \ctrl.o_ibus_adr).
Adding SRST signal on $auto$ff.cc:266:slice$1049 ($dffe) from module serv_top (D = { \ctrl.new_pc \ctrl.o_ibus_adr [31:1] }, Q = \ctrl.o_ibus_adr, rval = 0).
Adding EN signal on $flatten\bufreg2.$procdff$1005 ($dff) from module serv_top (D = $flatten\bufreg2.$ternary$inputs/serv_top.v:843$70_Y, Q = \bufreg2.dat).
Adding EN signal on $flatten\bufreg.$procdff$994 ($dff) from module serv_top (D = { $flatten\bufreg.$ternary$inputs/serv_top.v:769$651_Y \bufreg.data [29:1] }, Q = \bufreg.data).
Adding EN signal on $flatten\bufreg.$procdff$992 ($dff) from module serv_top (D = { $flatten\bufreg.$ternary$inputs/serv_top.v:772$654_Y \bufreg.lsb [1] }, Q = \bufreg.lsb).
Adding EN signal on $flatten\alu.$procdff$1013 ($dff) from module serv_top (D = \state.i_alu_cmp, Q = \alu.cmp_r).

yosys> opt_clean

4.9.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..
Removed 43 unused cells and 40 unused wires.
<suppressed ~44 debug messages>

yosys> opt_expr

4.9.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

4.9.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.9.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \serv_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~26 debug messages>

yosys> opt_reduce

4.9.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \serv_top.
Performed a total of 0 changes.

yosys> opt_merge

4.9.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_dff

4.9.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.9.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..

yosys> opt_expr

4.9.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

4.9.16. Finished OPT passes. (There is nothing left to do.)

yosys> wreduce

4.10. Executing WREDUCE pass (reducing word size of cells).
Removed top 2 bits (of 3) from port B of cell serv_top.$flatten\state.$eq$inputs/serv_top.v:1831$817 ($eq).
Removed top 2 bits (of 3) from port B of cell serv_top.$flatten\state.$add$inputs/serv_top.v:1920$874 ($add).
Removed top 1 bits (of 2) from port B of cell serv_top.$flatten\decode.$eq$inputs/serv_top.v:1297$794 ($eq).
Removed top 1 bits (of 2) from port B of cell serv_top.$flatten\decode.$eq$inputs/serv_top.v:1302$800 ($eq).
Removed top 1 bits (of 2) from port A of cell serv_top.$flatten\bufreg.$add$inputs/serv_top.v:762$646 ($add).
Removed top 1 bits (of 2) from port B of cell serv_top.$flatten\bufreg.$add$inputs/serv_top.v:762$646 ($add).
Removed top 1 bits (of 2) from port B of cell serv_top.$flatten\bufreg2.$eq$inputs/serv_top.v:836$62 ($eq).
Removed top 26 bits (of 32) from mux cell serv_top.$flatten\bufreg2.$ternary$inputs/serv_top.v:824$56 ($mux).
Removed top 31 bits (of 32) from port B of cell serv_top.$flatten\bufreg2.$sub$inputs/serv_top.v:826$52 ($sub).
Removed top 26 bits (of 32) from port Y of cell serv_top.$flatten\bufreg2.$sub$inputs/serv_top.v:826$52 ($sub).
Removed top 1 bits (of 2) from port A of cell serv_top.$flatten\rf_if.$or$inputs/serv_top.v:1717$610 ($or).
Removed top 4 bits (of 6) from mux cell serv_top.$flatten\rf_if.$ternary$inputs/serv_top.v:1681$602 ($mux).
Removed top 1 bits (of 2) from port B of cell serv_top.$flatten\genblk3.csr.$eq$inputs/serv_top.v:903$484 ($eq).
Removed top 26 bits (of 32) from wire serv_top.$flatten\bufreg2.$sub$inputs/serv_top.v:826$52_Y.

yosys> peepopt

4.11. Executing PEEPOPT pass (run peephole optimizers).

yosys> opt_clean

4.12. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..
Removed 0 unused cells and 2 unused wires.
<suppressed ~1 debug messages>

yosys> alumacc

4.13. Executing ALUMACC pass (create $alu and $macc cells).
Extracting $alu and $macc cells in module serv_top:
  creating $macc model for $flatten\alu.$add$inputs/serv_top.v:694$6 ($add).
  creating $macc model for $flatten\alu.$add$inputs/serv_top.v:694$7 ($add).
  creating $macc model for $flatten\alu.$add$inputs/serv_top.v:696$10 ($add).
  creating $macc model for $flatten\alu.$add$inputs/serv_top.v:696$9 ($add).
  creating $macc model for $flatten\bufreg.$add$inputs/serv_top.v:762$646 ($add).
  creating $macc model for $flatten\bufreg.$add$inputs/serv_top.v:762$647 ($add).
  creating $macc model for $flatten\bufreg2.$sub$inputs/serv_top.v:826$52 ($sub).
  creating $macc model for $flatten\ctrl.$add$inputs/serv_top.v:1043$619 ($add).
  creating $macc model for $flatten\ctrl.$add$inputs/serv_top.v:1043$620 ($add).
  creating $macc model for $flatten\ctrl.$add$inputs/serv_top.v:1055$627 ($add).
  creating $macc model for $flatten\ctrl.$add$inputs/serv_top.v:1055$628 ($add).
  creating $macc model for $flatten\state.$add$inputs/serv_top.v:1920$874 ($add).
  merging $macc model for $flatten\ctrl.$add$inputs/serv_top.v:1055$627 into $flatten\ctrl.$add$inputs/serv_top.v:1055$628.
  merging $macc model for $flatten\ctrl.$add$inputs/serv_top.v:1043$619 into $flatten\ctrl.$add$inputs/serv_top.v:1043$620.
  merging $macc model for $flatten\bufreg.$add$inputs/serv_top.v:762$646 into $flatten\bufreg.$add$inputs/serv_top.v:762$647.
  merging $macc model for $flatten\alu.$add$inputs/serv_top.v:696$9 into $flatten\alu.$add$inputs/serv_top.v:696$10.
  merging $macc model for $flatten\alu.$add$inputs/serv_top.v:694$6 into $flatten\alu.$add$inputs/serv_top.v:694$7.
  creating $alu model for $macc $flatten\bufreg2.$sub$inputs/serv_top.v:826$52.
  creating $alu model for $macc $flatten\bufreg.$add$inputs/serv_top.v:762$647.
  creating $alu model for $macc $flatten\ctrl.$add$inputs/serv_top.v:1043$620.
  creating $alu model for $macc $flatten\ctrl.$add$inputs/serv_top.v:1055$628.
  creating $alu model for $macc $flatten\alu.$add$inputs/serv_top.v:696$10.
  creating $alu model for $macc $flatten\alu.$add$inputs/serv_top.v:694$7.
  creating $alu model for $macc $flatten\state.$add$inputs/serv_top.v:1920$874.
  creating $alu cell for $flatten\state.$add$inputs/serv_top.v:1920$874: $auto$alumacc.cc:485:replace_alu$1056
  creating $alu cell for $flatten\alu.$add$inputs/serv_top.v:694$7: $auto$alumacc.cc:485:replace_alu$1059
  creating $alu cell for $flatten\alu.$add$inputs/serv_top.v:696$10: $auto$alumacc.cc:485:replace_alu$1062
  creating $alu cell for $flatten\ctrl.$add$inputs/serv_top.v:1055$628: $auto$alumacc.cc:485:replace_alu$1065
  creating $alu cell for $flatten\ctrl.$add$inputs/serv_top.v:1043$620: $auto$alumacc.cc:485:replace_alu$1068
  creating $alu cell for $flatten\bufreg.$add$inputs/serv_top.v:762$647: $auto$alumacc.cc:485:replace_alu$1071
  creating $alu cell for $flatten\bufreg2.$sub$inputs/serv_top.v:826$52: $auto$alumacc.cc:485:replace_alu$1074
  created 7 $alu and 0 $macc cells.

yosys> share

4.14. Executing SHARE pass (SAT-based resource sharing).

yosys> opt

4.15. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.15.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

yosys> opt_merge -nomux

4.15.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

4.15.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \serv_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~26 debug messages>

yosys> opt_reduce

4.15.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \serv_top.
Performed a total of 0 changes.

yosys> opt_merge

4.15.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_dff

4.15.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.15.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..
Removed 5 unused cells and 5 unused wires.
<suppressed ~6 debug messages>

yosys> opt_expr

4.15.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

4.15.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

4.15.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \serv_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~26 debug messages>

yosys> opt_reduce

4.15.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \serv_top.
Performed a total of 0 changes.

yosys> opt_merge

4.15.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_dff

4.15.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.15.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..

yosys> opt_expr

4.15.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

4.15.16. Finished OPT passes. (There is nothing left to do.)

yosys> memory -nomap

4.16. Executing MEMORY pass.

yosys> opt_mem

4.16.1. Executing OPT_MEM pass (optimize memories).
Performed a total of 0 transformations.

yosys> opt_mem_priority

4.16.2. Executing OPT_MEM_PRIORITY pass (removing unnecessary memory write priority relations).
Performed a total of 0 transformations.

yosys> opt_mem_feedback

4.16.3. Executing OPT_MEM_FEEDBACK pass (finding memory read-to-write feedback paths).

yosys> memory_bmux2rom

4.16.4. Executing MEMORY_BMUX2ROM pass (converting muxes to ROMs).

yosys> memory_dff

4.16.5. Executing MEMORY_DFF pass (merging $dff cells to $memrd).

yosys> opt_clean

4.16.6. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..

yosys> memory_share

4.16.7. Executing MEMORY_SHARE pass (consolidating $memrd/$memwr cells).

yosys> opt_mem_widen

4.16.8. Executing OPT_MEM_WIDEN pass (optimize memories where all ports are wide).
Performed a total of 0 transformations.

yosys> opt_clean

4.16.9. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..

yosys> memory_collect

4.16.10. Executing MEMORY_COLLECT pass (generating $mem cells).

yosys> opt_clean

4.17. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..

yosys> opt -fast -full

4.18. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

4.18.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.
<suppressed ~3 debug messages>

yosys> opt_merge

4.18.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_dff

4.18.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.18.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..
Removed 1 unused cells and 2 unused wires.
<suppressed ~2 debug messages>

4.18.5. Finished fast OPT passes.

yosys> memory_map

4.19. Executing MEMORY_MAP pass (converting memories to logic and flip-flops).

yosys> opt -full

4.20. Executing OPT pass (performing simple optimizations).

yosys> opt_expr -full

4.20.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

yosys> opt_merge -nomux

4.20.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

4.20.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \serv_top..
  Creating internal representation of mux trees.
  Evaluating internal representation of mux trees.
  Analyzing evaluation results.
Removed 0 multiplexer ports.
<suppressed ~26 debug messages>

yosys> opt_reduce -full

4.20.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \serv_top.
Performed a total of 0 changes.

yosys> opt_merge

4.20.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_share

4.20.6. Executing OPT_SHARE pass.

yosys> opt_dff

4.20.7. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.20.8. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..

yosys> opt_expr -full

4.20.9. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

4.20.10. Finished OPT passes. (There is nothing left to do.)

yosys> techmap

4.21. Executing TECHMAP pass (map to technology primitives).

4.21.1. Executing Verilog-2005 frontend: /usr/local/bin/../share/yosys/techmap.v
Parsing Verilog input from `/usr/local/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

4.21.2. Continuing TECHMAP pass.
Using extmapper simplemap for cells of type $logic_not.
Using extmapper simplemap for cells of type $and.
Using extmapper simplemap for cells of type $reduce_or.
Using extmapper simplemap for cells of type $eq.
Using extmapper simplemap for cells of type $or.
Using extmapper simplemap for cells of type $xor.
Using extmapper simplemap for cells of type $sdff.
Using extmapper simplemap for cells of type $sdffe.
Using extmapper simplemap for cells of type $dffe.
Using template $paramod$1d1e68f77481583066c6d429218f48ea9d5739b3\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $not.
Using extmapper simplemap for cells of type $mux.
Using extmapper simplemap for cells of type $dff.
Using template $paramod$a04dd9d4d8b430140c4ff94b50470fb380fda2a0\_90_alu for cells of type $alu.
Using template $paramod$3ef7d3dd227da7627a99c5e5a6a4deb817573e39\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $sdffce.
Using template $paramod$fc972a7a46956c1788f3cb5257b53c8f1df2d0cc\_90_alu for cells of type $alu.
Using extmapper simplemap for cells of type $pos.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000001 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000110 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000010 for cells of type $lcu.
Using template $paramod\_90_lcu\WIDTH=32'00000000000000000000000000000011 for cells of type $lcu.
No more expansions possible.
<suppressed ~1306 debug messages>

yosys> opt -fast

4.22. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.22.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.
<suppressed ~118 debug messages>

yosys> opt_merge

4.22.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
<suppressed ~99 debug messages>
Removed a total of 33 cells.

yosys> opt_dff

4.22.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.22.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..
Removed 19 unused cells and 261 unused wires.
<suppressed ~24 debug messages>

4.22.5. Finished fast OPT passes.

yosys> abc -fast

4.23. Executing ABC pass (technology mapping using ABC).

4.23.1. Extracting gate netlist of module `\serv_top' to `<abc-temp-dir>/input.blif'..
Extracted 493 gates and 664 wires to a netlist network with 169 inputs and 129 outputs.

4.23.1.1. Executing ABC.
Running ABC command: "<yosys-exe-dir>/yosys-abc" -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_library <abc-temp-dir>/stdcells.genlib 
ABC: Entered genlib library with 13 gates from file "<abc-temp-dir>/stdcells.genlib".
ABC: + strash 
ABC: + dretime 
ABC: + map 
ABC: + write_blif <abc-temp-dir>/output.blif 

4.23.1.2. Re-integrating ABC results.
ABC RESULTS:               NOT cells:       18
ABC RESULTS:              XNOR cells:        3
ABC RESULTS:               MUX cells:       90
ABC RESULTS:               NOR cells:       28
ABC RESULTS:                OR cells:       83
ABC RESULTS:             ORNOT cells:       14
ABC RESULTS:              NAND cells:       17
ABC RESULTS:            ANDNOT cells:      140
ABC RESULTS:               AND cells:       28
ABC RESULTS:               XOR cells:       18
ABC RESULTS:        internal signals:      366
ABC RESULTS:           input signals:      169
ABC RESULTS:          output signals:      129
Removing temp directory.

yosys> opt -fast

4.24. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

4.24.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.
<suppressed ~3 debug messages>

yosys> opt_merge

4.24.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
<suppressed ~6 debug messages>
Removed a total of 2 cells.

yosys> opt_dff

4.24.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean

4.24.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..
Removed 1 unused cells and 665 unused wires.
<suppressed ~165 debug messages>

4.24.5. Finished fast OPT passes.

yosys> hierarchy -check

4.25. Executing HIERARCHY pass (managing design hierarchy).

4.25.1. Analyzing design hierarchy..
Top module:  \serv_top

4.25.2. Analyzing design hierarchy..
Top module:  \serv_top
Removed 0 unused modules.

yosys> stat

4.26. Printing statistics.

=== serv_top ===

   Number of wires:                721
   Number of wire bits:           1528
   Number of public wires:         319
   Number of public wire bits:    1122
   Number of memories:               0
   Number of memory bits:            0
   Number of processes:              0
   Number of cells:                601
     $_ANDNOT_                     139
     $_AND_                         28
     $_DFFE_PN_                      1
     $_DFFE_PP_                    114
     $_DFF_P_                        4
     $_MUX_                         90
     $_NAND_                        17
     $_NOR_                         27
     $_NOT_                         17
     $_ORNOT_                       14
     $_OR_                          83
     $_SDFFCE_PP0P_                 32
     $_SDFFE_PP0P_                   5
     $_SDFF_PP0_                     9
     $_XNOR_                         3
     $_XOR_                         18


yosys> check

4.27. Executing CHECK pass (checking for obvious problems).
Checking module serv_top...
Found and reported 0 problems.

yosys> opt -purge

5. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

5.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

yosys> opt_merge -nomux

5.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

5.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \serv_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \serv_top.
Performed a total of 0 changes.

yosys> opt_merge

5.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_dff

5.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

5.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..
Removed 0 unused cells and 236 unused wires.
<suppressed ~236 debug messages>

yosys> opt_expr

5.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

5.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

5.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \serv_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

5.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \serv_top.
Performed a total of 0 changes.

yosys> opt_merge

5.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_dff

5.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

5.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..

yosys> opt_expr

5.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

5.16. Finished OPT passes. (There is nothing left to do.)

yosys> techmap -map /home/siliconcompiler/third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_latch.v

6. Executing TECHMAP pass (map to technology primitives).

6.1. Executing Verilog-2005 frontend: /home/siliconcompiler/third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_latch.v
Parsing Verilog input from `/home/siliconcompiler/third_party/pdks/skywater/skywater130/libs/sky130hd/v0_0_2/techmap/yosys/cells_latch.v' to AST representation.
Generating RTLIL representation for module `\$_DLATCH_P_'.
Generating RTLIL representation for module `\$_DLATCH_N_'.
Successfully finished Verilog frontend.

6.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~4 debug messages>

yosys> techmap

7. Executing TECHMAP pass (map to technology primitives).

7.1. Executing Verilog-2005 frontend: /usr/local/bin/../share/yosys/techmap.v
Parsing Verilog input from `/usr/local/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

7.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~73 debug messages>

yosys> opt -fast -purge

8. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

8.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

yosys> opt_merge

8.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_dff

8.3. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

8.4. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..

8.5. Finished fast OPT passes.

yosys> autoname

9. Executing AUTONAME pass.
Renamed 3884 objects in module serv_top (30 iterations).
<suppressed ~1003 debug messages>

yosys> dfflibmap -liberty inputs/sc_dff_library.lib

10. Executing DFFLIBMAP pass (mapping DFF cells to sequential cells from liberty file).
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  cell sky130_fd_sc_hd__dfxtp_1 (noninv, pins=3, area=20.02) is a direct match for cell type $_DFF_P_.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
  cell sky130_fd_sc_hd__dfrtn_1 (noninv, pins=4, area=25.02) is a direct match for cell type $_DFF_NN0_.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  cell sky130_fd_sc_hd__dfrtp_1 (noninv, pins=4, area=25.02) is a direct match for cell type $_DFF_PN0_.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  cell sky130_fd_sc_hd__dfstp_2 (noninv, pins=4, area=26.28) is a direct match for cell type $_DFF_PN1_.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
  cell sky130_fd_sc_hd__dfbbn_1 (noninv, pins=6, area=32.53) is a direct match for cell type $_DFFSR_NNN_.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbn_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtn_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  cell sky130_fd_sc_hd__dfbbp_1 (noninv, pins=6, area=32.53) is a direct match for cell type $_DFFSR_PNN_.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE|IQ&!DE' in pin attribute of cell 'sky130_fd_sc_hd__edfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfbbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfrtp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfsbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfstp_4' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxbp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_1' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_2' - skipping.
Warning: Found unsupported expression 'D&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sdfxtp_4' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxbp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_1' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_2' - skipping.
Warning: Found unsupported expression 'D&DE&!SCE|IQ&!DE&!SCE|SCD&SCE' in pin attribute of cell 'sky130_fd_sc_hd__sedfxtp_4' - skipping.
  final dff cell mappings:
    unmapped dff cell: $_DFF_N_
    \sky130_fd_sc_hd__dfxtp_1 _DFF_P_ (.CLK( C), .D( D), .Q( Q));
    \sky130_fd_sc_hd__dfrtn_1 _DFF_NN0_ (.CLK_N( C), .D( D), .Q( Q), .RESET_B( R));
    unmapped dff cell: $_DFF_NN1_
    unmapped dff cell: $_DFF_NP0_
    unmapped dff cell: $_DFF_NP1_
    \sky130_fd_sc_hd__dfrtp_1 _DFF_PN0_ (.CLK( C), .D( D), .Q( Q), .RESET_B( R));
    \sky130_fd_sc_hd__dfstp_2 _DFF_PN1_ (.CLK( C), .D( D), .Q( Q), .SET_B( R));
    unmapped dff cell: $_DFF_PP0_
    unmapped dff cell: $_DFF_PP1_
    \sky130_fd_sc_hd__dfbbn_1 _DFFSR_NNN_ (.CLK_N( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B( R), .SET_B( S));
    unmapped dff cell: $_DFFSR_NNP_
    unmapped dff cell: $_DFFSR_NPN_
    unmapped dff cell: $_DFFSR_NPP_
    \sky130_fd_sc_hd__dfbbp_1 _DFFSR_PNN_ (.CLK( C), .D( D), .Q( Q), .Q_N(~Q), .RESET_B( R), .SET_B( S));
    unmapped dff cell: $_DFFSR_PNP_
    unmapped dff cell: $_DFFSR_PPN_
    unmapped dff cell: $_DFFSR_PPP_

yosys> dfflegalize -cell $_DFF_P_ 01 -cell $_DFF_NN0_ 01 -cell $_DFF_PN0_ 01 -cell $_DFF_PN1_ 01 -cell $_DFFSR_NNN_ 01 -cell $_DFFSR_PNN_ 01 t:$_DFF* t:$_SDFF*

10.1. Executing DFFLEGALIZE pass (convert FFs to types supported by the target).
Mapping DFF cells in module `\serv_top':
  mapped 165 $_DFF_P_ cells to \sky130_fd_sc_hd__dfxtp_1 cells.

yosys> techmap

11. Executing TECHMAP pass (map to technology primitives).

11.1. Executing Verilog-2005 frontend: /usr/local/bin/../share/yosys/techmap.v
Parsing Verilog input from `/usr/local/bin/../share/yosys/techmap.v' to AST representation.
Generating RTLIL representation for module `\_90_simplemap_bool_ops'.
Generating RTLIL representation for module `\_90_simplemap_reduce_ops'.
Generating RTLIL representation for module `\_90_simplemap_logic_ops'.
Generating RTLIL representation for module `\_90_simplemap_compare_ops'.
Generating RTLIL representation for module `\_90_simplemap_various'.
Generating RTLIL representation for module `\_90_simplemap_registers'.
Generating RTLIL representation for module `\_90_shift_ops_shr_shl_sshl_sshr'.
Generating RTLIL representation for module `\_90_shift_shiftx'.
Generating RTLIL representation for module `\_90_fa'.
Generating RTLIL representation for module `\_90_lcu'.
Generating RTLIL representation for module `\_90_alu'.
Generating RTLIL representation for module `\_90_macc'.
Generating RTLIL representation for module `\_90_alumacc'.
Generating RTLIL representation for module `\$__div_mod_u'.
Generating RTLIL representation for module `\$__div_mod_trunc'.
Generating RTLIL representation for module `\_90_div'.
Generating RTLIL representation for module `\_90_mod'.
Generating RTLIL representation for module `\$__div_mod_floor'.
Generating RTLIL representation for module `\_90_divfloor'.
Generating RTLIL representation for module `\_90_modfloor'.
Generating RTLIL representation for module `\_90_pow'.
Generating RTLIL representation for module `\_90_pmux'.
Generating RTLIL representation for module `\_90_demux'.
Generating RTLIL representation for module `\_90_lut'.
Successfully finished Verilog frontend.

11.2. Continuing TECHMAP pass.
No more expansions possible.
<suppressed ~73 debug messages>

yosys> opt -purge

12. Executing OPT pass (performing simple optimizations).

yosys> opt_expr

12.1. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

yosys> opt_merge -nomux

12.2. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_muxtree

12.3. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \serv_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

12.4. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \serv_top.
Performed a total of 0 changes.

yosys> opt_merge

12.5. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_dff

12.6. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

12.7. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..
Removed 0 unused cells and 1 unused wires.
<suppressed ~1 debug messages>

yosys> opt_expr

12.8. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

12.9. Rerunning OPT passes. (Maybe there is more to do..)

yosys> opt_muxtree

12.10. Executing OPT_MUXTREE pass (detect dead branches in mux trees).
Running muxtree optimizer on module \serv_top..
  Creating internal representation of mux trees.
  No muxes found in this module.
Removed 0 multiplexer ports.

yosys> opt_reduce

12.11. Executing OPT_REDUCE pass (consolidate $*mux and $reduce_* inputs).
  Optimizing cells in module \serv_top.
Performed a total of 0 changes.

yosys> opt_merge

12.12. Executing OPT_MERGE pass (detect identical cells).
Finding identical cells in module `\serv_top'.
Removed a total of 0 cells.

yosys> opt_dff

12.13. Executing OPT_DFF pass (perform DFF optimizations).

yosys> opt_clean -purge

12.14. Executing OPT_CLEAN pass (remove unused cells and wires).
Finding unused cells or wires in module \serv_top..

yosys> opt_expr

12.15. Executing OPT_EXPR pass (perform const folding).
Optimizing module serv_top.

12.16. Finished OPT passes. (There is nothing left to do.)

yosys> abc -liberty inputs/sc_dff_library.lib -constr inputs/sc_abc.constraints -liberty inputs/sc_logiclib_sky130hd_sky130_fd_sc_hd__ss_n40C_1v40.lib.lib

13. Executing ABC pass (technology mapping using ABC).

13.1. Extracting gate netlist of module `\serv_top' to `<abc-temp-dir>/input.blif'..
Extracted 634 gates and 869 wires to a netlist network with 234 inputs and 191 outputs.

13.1.1. Executing ABC.
Running ABC command: "<yosys-exe-dir>/yosys-abc" -s -f <abc-temp-dir>/abc.script 2>&1
ABC: ABC command line: "source <abc-temp-dir>/abc.script".
ABC: 
ABC: + read_blif <abc-temp-dir>/input.blif 
ABC: + read_lib -w /home/host/serv/build/serv_top/job0/syn/0/inputs/sc_dff_library.lib 
ABC: Parsing finished successfully.  Parsing time =     0.21 sec
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__buf_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_12" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_3" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_6" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_8" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__diode_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_8".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_0".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_8".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_8".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_bleeder_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_12" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_3" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_6" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso0n_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso0p_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso1n_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso1p_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__lpflow_inputisolatch_1".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrckapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__probe_p_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__probec_p_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_4".
ABC: Library "sky130_fd_sc_hd__ss_n40C_1v40" from "/home/host/serv/build/serv_top/job0/syn/0/inputs/sc_dff_library.lib" has 301 cells (88 skipped: 63 seq; 13 tri-state; 12 no func; 39 dont_use).  Time =     0.29 sec
ABC: Memory =   19.86 MB. Time =     0.29 sec
ABC: Warning: Detected 9 multi-output gates (for example, "sky130_fd_sc_hd__fa_1").
ABC: + read_lib -w /home/host/serv/build/serv_top/job0/syn/0/inputs/sc_logiclib_sky130hd_sky130_fd_sc_hd__ss_n40C_1v40.lib.lib 
ABC: Parsing finished successfully.  Parsing time =     0.21 sec
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__buf_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_12" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_3" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_6" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__decap_8" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__diode_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__dlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtn_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__dlxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__ebufn_8".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__edfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_0".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvn_8".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_1".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_2".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_4".
ABC: Scl_LibertyReadGenlib() skipped three-state cell "sky130_fd_sc_hd__einvp_8".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_bleeder_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkbufkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_clkinvkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_12" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_3" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_6" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_decapkapwr_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso0n_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso0p_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso1n_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_inputiso1p_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__lpflow_inputisolatch_1".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrc_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_isobufsrckapwr_16" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_hl_isowell_tap_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__lpflow_lsbuf_lh_isowell_tap_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_1" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_2" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__maj3_4" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__probe_p_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__probec_p_8" due to dont_use attribute.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbn_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfbbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtn_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfrtp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfsbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfstp_4".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sdfxtp_4".
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_1" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_2" without logic function.
ABC: Scl_LibertyReadGenlib() skipped cell "sky130_fd_sc_hd__sdlclkp_4" without logic function.
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxbp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_1".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_2".
ABC: Scl_LibertyReadGenlib() skipped sequential cell "sky130_fd_sc_hd__sedfxtp_4".
ABC: Library "sky130_fd_sc_hd__ss_n40C_1v40" from "/home/host/serv/build/serv_top/job0/syn/0/inputs/sc_logiclib_sky130hd_sky130_fd_sc_hd__ss_n40C_1v40.lib.lib" has 301 cells (88 skipped: 63 seq; 13 tri-state; 12 no func; 39 dont_use).  Time =     0.29 sec
ABC: Memory =   19.86 MB. Time =     0.29 sec
ABC: Warning: Detected 9 multi-output gates (for example, "sky130_fd_sc_hd__fa_1").
ABC: + read_constr -v /home/host/serv/build/serv_top/job0/syn/0/inputs/sc_abc.constraints 
ABC: Setting driving cell to be "sky130_fd_sc_hd__buf_4".
ABC: + strash 
ABC: + &get -n 
ABC: + &fraig -x 
ABC: + &put 
ABC: + scorr 
ABC: Warning: The network is combinational (run "fraig" or "fraig_sweep").
ABC: + dc2 
ABC: + dretime 
ABC: + strash 
ABC: + &get -n 
ABC: + &dch -f 
ABC: + &nf 
ABC: + &put 
ABC: + buffer 
ABC: + upsize 
ABC: + dnsize 
ABC: + stime -p 
ABC: WireLoad = "none"  Gates =    598 ( 10.0 %)   Cap =  4.1 ff (  8.4 %)   Area =     3896.24 ( 77.3 %)   Delay =  7211.21 ps  ( 11.2 %)               
ABC: Path  0 --      44 : 0    2 pi                        A =   0.00  Df =  71.2  -30.9 ps  S = 132.2 ps  Cin =  0.0 ff  Cout =   8.3 ff  Cmax =   0.0 ff  G =    0  
ABC: Path  1 --     435 : 1   10 sky130_fd_sc_hd__buf_6    A =  11.26  Df = 502.2  -31.8 ps  S = 263.4 ps  Cin =  4.0 ff  Cout =  29.2 ff  Cmax =1348.1 ff  G =  705  
ABC: Path  2 --     577 : 3    2 sky130_fd_sc_hd__nand3_4  A =  17.52  Df = 738.3  -28.5 ps  S = 180.9 ps  Cin =  7.6 ff  Cout =   5.5 ff  Cmax = 898.8 ff  G =   69  
ABC: Path  3 --     578 : 2    5 sky130_fd_sc_hd__nand2_2  A =   6.26  Df =1016.2  -71.4 ps  S = 270.3 ps  Cin =  3.9 ff  Cout =  10.9 ff  Cmax = 537.9 ff  G =  269  
ABC: Path  4 --     584 : 5    5 sky130_fd_sc_hd__a221o_1  A =  10.01  Df =2521.4 -269.2 ps  S = 369.7 ps  Cin =  2.1 ff  Cout =   9.3 ff  Cmax = 296.0 ff  G =  432  
ABC: Path  5 --     585 : 2    2 sky130_fd_sc_hd__nand2_1  A =   3.75  Df =2832.7 -293.0 ps  S = 198.6 ps  Cin =  2.0 ff  Cout =   4.4 ff  Cmax = 320.4 ff  G =  206  
ABC: Path  6 --     742 : 3    3 sky130_fd_sc_hd__xnor3_1  A =  22.52  Df =4739.1 -915.8 ps  S = 318.7 ps  Cin =  3.4 ff  Cout =   7.8 ff  Cmax = 309.8 ff  G =  216  
ABC: Path  7 --     745 : 3    2 sky130_fd_sc_hd__nor3_2   A =  10.01  Df =5457.8-1423.6 ps  S = 519.0 ps  Cin =  3.9 ff  Cout =   4.4 ff  Cmax = 157.9 ff  G =  109  
ABC: Path  8 --     931 : 4    1 sky130_fd_sc_hd__a211oi_1 A =   7.51  Df =5791.3  -23.1 ps  S = 894.1 ps  Cin =  2.1 ff  Cout =   4.1 ff  Cmax =  74.8 ff  G =  182  
ABC: Path  9 --     935 : 5    2 sky130_fd_sc_hd__o311ai_2 A =  16.27  Df =6812.7 -450.9 ps  S = 751.2 ps  Cin =  3.9 ff  Cout =   3.7 ff  Cmax = 138.9 ff  G =   90  
ABC: Path 10 --     943 : 3    1 sky130_fd_sc_hd__o21ai_0  A =   5.00  Df =7211.2 -477.3 ps  S = 185.3 ps  Cin =  1.5 ff  Cout =   0.0 ff  Cmax =  83.9 ff  G =    0  
ABC: Start-point = pi43 (\decode.opcode [2]).  End-point = po151 ($auto$rtlil.cc:2607:MuxGate$2695).
ABC: + write_blif <abc-temp-dir>/output.blif 

13.1.2. Re-integrating ABC results.
ABC RESULTS:   sky130_fd_sc_hd__buf_6 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__o22ai_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__nand3_4 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__nand2_2 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__o31ai_2 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__nor2_2 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__a41oi_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__buf_1 cells:        8
ABC RESULTS:   sky130_fd_sc_hd__nor3b_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__a221oi_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__or2_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__and3b_1 cells:        5
ABC RESULTS:   sky130_fd_sc_hd__xnor3_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__and2_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__nor3_2 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__mux2_4 cells:       27
ABC RESULTS:   sky130_fd_sc_hd__or3_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__o311ai_0 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__o21a_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__buf_2 cells:        9
ABC RESULTS:   sky130_fd_sc_hd__o21ba_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__nand3b_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__o211ai_1 cells:        4
ABC RESULTS:   sky130_fd_sc_hd__xor2_1 cells:        5
ABC RESULTS:   sky130_fd_sc_hd__a31o_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__a22o_1 cells:       32
ABC RESULTS:   sky130_fd_sc_hd__a211o_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__o21ai_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__o221ai_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__nor4_2 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__a22oi_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__mux2i_1 cells:       45
ABC RESULTS:   sky130_fd_sc_hd__o31a_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__o31ai_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__mux4_2 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__clkbuf_1 cells:       23
ABC RESULTS:   sky130_fd_sc_hd__and4_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__o211a_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__o311ai_2 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__a32oi_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__xnor2_1 cells:        5
ABC RESULTS:   sky130_fd_sc_hd__nand4_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__o41ai_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__a21boi_0 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__nand3_1 cells:       13
ABC RESULTS:   sky130_fd_sc_hd__nor4_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__nor2b_1 cells:        7
ABC RESULTS:   sky130_fd_sc_hd__a21o_1 cells:        7
ABC RESULTS:   sky130_fd_sc_hd__o21bai_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__a2111oi_0 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__nor3_1 cells:       12
ABC RESULTS:   sky130_fd_sc_hd__inv_1 cells:       19
ABC RESULTS:   sky130_fd_sc_hd__and3_1 cells:        4
ABC RESULTS:   sky130_fd_sc_hd__a221o_1 cells:        7
ABC RESULTS:   sky130_fd_sc_hd__mux2_2 cells:       14
ABC RESULTS:   sky130_fd_sc_hd__nor4b_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__and4b_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__a211oi_1 cells:       10
ABC RESULTS:   sky130_fd_sc_hd__a31oi_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__a32o_1 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__o41ai_2 cells:        2
ABC RESULTS:   sky130_fd_sc_hd__o21ai_0 cells:       51
ABC RESULTS:   sky130_fd_sc_hd__or4_1 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__o32ai_1 cells:        1
ABC RESULTS:   sky130_fd_sc_hd__nor2_1 cells:       80
ABC RESULTS:   sky130_fd_sc_hd__and2_0 cells:        3
ABC RESULTS:   sky130_fd_sc_hd__nand2b_1 cells:       10
ABC RESULTS:   sky130_fd_sc_hd__a21oi_1 cells:       58
ABC RESULTS:   sky130_fd_sc_hd__nand2_1 cells:       68
ABC RESULTS:        internal signals:      444
ABC RESULTS:           input signals:      234
ABC RESULTS:          output signals:      191
Removing temp directory.

yosys> setundef -zero

14. Executing SETUNDEF pass (replace undef values with defined constants).

yosys> splitnets

15. Executing SPLITNETS pass (splitting up multi-bit signals).

yosys> clean -purge
Removed 0 unused cells and 873 unused wires.

yosys> hilomap -singleton -locell sky130_fd_sc_hd__conb_1 LO -hicell sky130_fd_sc_hd__conb_1 HI

16. Executing HILOMAP pass (mapping to constant drivers).

yosys> insbuf -buf sky130_fd_sc_hd__buf_4 A X

17. Executing INSBUF pass (insert buffer cells for connected wires).
Add serv_top/$auto$insbuf.cc:97:execute$3756: $auto$hilomap.cc:47:hilomap_worker$3752 -> \o_dbus_adr [0]
Add serv_top/$auto$insbuf.cc:97:execute$3757: $auto$hilomap.cc:47:hilomap_worker$3752 -> \o_dbus_adr [1]
Add serv_top/$auto$insbuf.cc:97:execute$3758: \bufreg2.o_sh_done_r -> \o_dbus_dat [5]
Add serv_top/$auto$insbuf.cc:97:execute$3759: \decode.co_bne_or_bge -> \o_ext_funct3 [0]
Add serv_top/$auto$insbuf.cc:97:execute$3760: \decode.co_mem_word -> \o_ext_funct3 [1]
Add serv_top/$auto$insbuf.cc:97:execute$3761: \decode.co_csr_d_sel -> \o_ext_funct3 [2]
Add serv_top/$auto$insbuf.cc:97:execute$3762: \state.i_ctrl_misalign -> \o_ext_rs1 [1]
Add serv_top/$auto$insbuf.cc:97:execute$3763: \o_dbus_adr [2] -> \o_ext_rs1 [2]
Add serv_top/$auto$insbuf.cc:97:execute$3764: \o_dbus_adr [3] -> \o_ext_rs1 [3]
Add serv_top/$auto$insbuf.cc:97:execute$3765: \o_dbus_adr [4] -> \o_ext_rs1 [4]
Add serv_top/$auto$insbuf.cc:97:execute$3766: \o_dbus_adr [5] -> \o_ext_rs1 [5]
Add serv_top/$auto$insbuf.cc:97:execute$3767: \o_dbus_adr [6] -> \o_ext_rs1 [6]
Add serv_top/$auto$insbuf.cc:97:execute$3768: \o_dbus_adr [7] -> \o_ext_rs1 [7]
Add serv_top/$auto$insbuf.cc:97:execute$3769: \o_dbus_adr [8] -> \o_ext_rs1 [8]
Add serv_top/$auto$insbuf.cc:97:execute$3770: \o_dbus_adr [9] -> \o_ext_rs1 [9]
Add serv_top/$auto$insbuf.cc:97:execute$3771: \o_dbus_adr [10] -> \o_ext_rs1 [10]
Add serv_top/$auto$insbuf.cc:97:execute$3772: \o_dbus_adr [11] -> \o_ext_rs1 [11]
Add serv_top/$auto$insbuf.cc:97:execute$3773: \o_dbus_adr [12] -> \o_ext_rs1 [12]
Add serv_top/$auto$insbuf.cc:97:execute$3774: \o_dbus_adr [13] -> \o_ext_rs1 [13]
Add serv_top/$auto$insbuf.cc:97:execute$3775: \o_dbus_adr [14] -> \o_ext_rs1 [14]
Add serv_top/$auto$insbuf.cc:97:execute$3776: \o_dbus_adr [15] -> \o_ext_rs1 [15]
Add serv_top/$auto$insbuf.cc:97:execute$3777: \o_dbus_adr [16] -> \o_ext_rs1 [16]
Add serv_top/$auto$insbuf.cc:97:execute$3778: \o_dbus_adr [17] -> \o_ext_rs1 [17]
Add serv_top/$auto$insbuf.cc:97:execute$3779: \o_dbus_adr [18] -> \o_ext_rs1 [18]
Add serv_top/$auto$insbuf.cc:97:execute$3780: \o_dbus_adr [19] -> \o_ext_rs1 [19]
Add serv_top/$auto$insbuf.cc:97:execute$3781: \o_dbus_adr [20] -> \o_ext_rs1 [20]
Add serv_top/$auto$insbuf.cc:97:execute$3782: \o_dbus_adr [21] -> \o_ext_rs1 [21]
Add serv_top/$auto$insbuf.cc:97:execute$3783: \o_dbus_adr [22] -> \o_ext_rs1 [22]
Add serv_top/$auto$insbuf.cc:97:execute$3784: \o_dbus_adr [23] -> \o_ext_rs1 [23]
Add serv_top/$auto$insbuf.cc:97:execute$3785: \o_dbus_adr [24] -> \o_ext_rs1 [24]
Add serv_top/$auto$insbuf.cc:97:execute$3786: \o_dbus_adr [25] -> \o_ext_rs1 [25]
Add serv_top/$auto$insbuf.cc:97:execute$3787: \o_dbus_adr [26] -> \o_ext_rs1 [26]
Add serv_top/$auto$insbuf.cc:97:execute$3788: \o_dbus_adr [27] -> \o_ext_rs1 [27]
Add serv_top/$auto$insbuf.cc:97:execute$3789: \o_dbus_adr [28] -> \o_ext_rs1 [28]
Add serv_top/$auto$insbuf.cc:97:execute$3790: \o_dbus_adr [29] -> \o_ext_rs1 [29]
Add serv_top/$auto$insbuf.cc:97:execute$3791: \o_dbus_adr [30] -> \o_ext_rs1 [30]
Add serv_top/$auto$insbuf.cc:97:execute$3792: \o_dbus_adr [31] -> \o_ext_rs1 [31]
Add serv_top/$auto$insbuf.cc:97:execute$3793: \o_dbus_dat [0] -> \o_ext_rs2 [0]
Add serv_top/$auto$insbuf.cc:97:execute$3794: \o_dbus_dat [1] -> \o_ext_rs2 [1]
Add serv_top/$auto$insbuf.cc:97:execute$3795: \o_dbus_dat [2] -> \o_ext_rs2 [2]
Add serv_top/$auto$insbuf.cc:97:execute$3796: \o_dbus_dat [3] -> \o_ext_rs2 [3]
Add serv_top/$auto$insbuf.cc:97:execute$3797: \o_dbus_dat [4] -> \o_ext_rs2 [4]
Add serv_top/$auto$insbuf.cc:97:execute$3798: \bufreg2.o_sh_done_r -> \o_ext_rs2 [5]
Add serv_top/$auto$insbuf.cc:97:execute$3799: \o_dbus_dat [6] -> \o_ext_rs2 [6]
Add serv_top/$auto$insbuf.cc:97:execute$3800: \o_dbus_dat [7] -> \o_ext_rs2 [7]
Add serv_top/$auto$insbuf.cc:97:execute$3801: \o_dbus_dat [8] -> \o_ext_rs2 [8]
Add serv_top/$auto$insbuf.cc:97:execute$3802: \o_dbus_dat [9] -> \o_ext_rs2 [9]
Add serv_top/$auto$insbuf.cc:97:execute$3803: \o_dbus_dat [10] -> \o_ext_rs2 [10]
Add serv_top/$auto$insbuf.cc:97:execute$3804: \o_dbus_dat [11] -> \o_ext_rs2 [11]
Add serv_top/$auto$insbuf.cc:97:execute$3805: \o_dbus_dat [12] -> \o_ext_rs2 [12]
Add serv_top/$auto$insbuf.cc:97:execute$3806: \o_dbus_dat [13] -> \o_ext_rs2 [13]
Add serv_top/$auto$insbuf.cc:97:execute$3807: \o_dbus_dat [14] -> \o_ext_rs2 [14]
Add serv_top/$auto$insbuf.cc:97:execute$3808: \o_dbus_dat [15] -> \o_ext_rs2 [15]
Add serv_top/$auto$insbuf.cc:97:execute$3809: \o_dbus_dat [16] -> \o_ext_rs2 [16]
Add serv_top/$auto$insbuf.cc:97:execute$3810: \o_dbus_dat [17] -> \o_ext_rs2 [17]
Add serv_top/$auto$insbuf.cc:97:execute$3811: \o_dbus_dat [18] -> \o_ext_rs2 [18]
Add serv_top/$auto$insbuf.cc:97:execute$3812: \o_dbus_dat [19] -> \o_ext_rs2 [19]
Add serv_top/$auto$insbuf.cc:97:execute$3813: \o_dbus_dat [20] -> \o_ext_rs2 [20]
Add serv_top/$auto$insbuf.cc:97:execute$3814: \o_dbus_dat [21] -> \o_ext_rs2 [21]
Add serv_top/$auto$insbuf.cc:97:execute$3815: \o_dbus_dat [22] -> \o_ext_rs2 [22]
Add serv_top/$auto$insbuf.cc:97:execute$3816: \o_dbus_dat [23] -> \o_ext_rs2 [23]
Add serv_top/$auto$insbuf.cc:97:execute$3817: \o_dbus_dat [24] -> \o_ext_rs2 [24]
Add serv_top/$auto$insbuf.cc:97:execute$3818: \o_dbus_dat [25] -> \o_ext_rs2 [25]
Add serv_top/$auto$insbuf.cc:97:execute$3819: \o_dbus_dat [26] -> \o_ext_rs2 [26]
Add serv_top/$auto$insbuf.cc:97:execute$3820: \o_dbus_dat [27] -> \o_ext_rs2 [27]
Add serv_top/$auto$insbuf.cc:97:execute$3821: \o_dbus_dat [28] -> \o_ext_rs2 [28]
Add serv_top/$auto$insbuf.cc:97:execute$3822: \o_dbus_dat [29] -> \o_ext_rs2 [29]
Add serv_top/$auto$insbuf.cc:97:execute$3823: \o_dbus_dat [30] -> \o_ext_rs2 [30]
Add serv_top/$auto$insbuf.cc:97:execute$3824: \o_dbus_dat [31] -> \o_ext_rs2 [31]
Add serv_top/$auto$insbuf.cc:97:execute$3825: \ctrl.pc -> \o_ibus_adr [0]
Add serv_top/$auto$insbuf.cc:97:execute$3826: $auto$hilomap.cc:47:hilomap_worker$3752 -> \o_mdu_valid
Add serv_top/$auto$insbuf.cc:97:execute$3827: \genblk3.csr.i_csr_imm -> \o_rreg0 [0]
Add serv_top/$auto$insbuf.cc:97:execute$3828: \immdec.imm19_12_20[5] -> \o_rreg0 [1]
Add serv_top/$auto$insbuf.cc:97:execute$3829: \immdec.imm19_12_20[6] -> \o_rreg0 [2]
Add serv_top/$auto$insbuf.cc:97:execute$3830: \immdec.imm19_12_20[7] -> \o_rreg0 [3]
Add serv_top/$auto$insbuf.cc:97:execute$3831: \immdec.imm19_12_20[8] -> \o_rreg0 [4]
Add serv_top/$auto$insbuf.cc:97:execute$3832: $auto$hilomap.cc:47:hilomap_worker$3752 -> \o_rreg0 [5]
Add serv_top/$auto$insbuf.cc:97:execute$3833: \genblk3.csr.i_trap -> \o_wreg0 [5]
Add serv_top/$auto$insbuf.cc:97:execute$3834: $auto$hilomap.cc:47:hilomap_worker$3752 -> \o_wreg1 [2]
Add serv_top/$auto$insbuf.cc:97:execute$3835: $auto$hilomap.cc:47:hilomap_worker$3752 -> \o_wreg1 [3]
Add serv_top/$auto$insbuf.cc:97:execute$3836: $auto$hilomap.cc:47:hilomap_worker$3752 -> \o_wreg1 [4]
Add serv_top/$auto$insbuf.cc:97:execute$3837: $auto$hilomap.cc:39:hilomap_worker$3754 -> \o_wreg1 [5]

yosys> clean -purge

yosys> echo off
echo off
{
   "creator": "Yosys 0.27+22 (git sha1 53c0a6b78, clang 10.0.0-4ubuntu1 -fPIC -Os)",
   "invocation": "stat -json -top serv_top -liberty inputs/sc_dff_library.lib -liberty inputs/sc_logiclib_sky130hd_sky130_fd_sc_hd__ss_n40C_1v40.lib.lib ",
   "modules": {
      "\\serv_top": {
         "num_wires":         679,
         "num_wire_bits":     952,
         "num_pub_wires":     109,
         "num_pub_wire_bits": 382,
         "num_memories":      0,
         "num_memory_bits":   0,
         "num_processes":     0,
         "num_cells":         847,
         "area":              7822.502400,
         "num_cells_by_type": {
            "sky130_fd_sc_hd__a2111oi_0": 1,
            "sky130_fd_sc_hd__a211o_1": 1,
            "sky130_fd_sc_hd__a211oi_1": 10,
            "sky130_fd_sc_hd__a21boi_0": 2,
            "sky130_fd_sc_hd__a21o_1": 7,
            "sky130_fd_sc_hd__a21oi_1": 58,
            "sky130_fd_sc_hd__a221o_1": 7,
            "sky130_fd_sc_hd__a221oi_1": 2,
            "sky130_fd_sc_hd__a22o_1": 32,
            "sky130_fd_sc_hd__a22oi_1": 3,
            "sky130_fd_sc_hd__a31o_1": 1,
            "sky130_fd_sc_hd__a31oi_1": 3,
            "sky130_fd_sc_hd__a32o_1": 2,
            "sky130_fd_sc_hd__a32oi_1": 2,
            "sky130_fd_sc_hd__a41oi_1": 1,
            "sky130_fd_sc_hd__and2_0": 3,
            "sky130_fd_sc_hd__and2_1": 3,
            "sky130_fd_sc_hd__and3_1": 4,
            "sky130_fd_sc_hd__and3b_1": 5,
            "sky130_fd_sc_hd__and4_1": 1,
            "sky130_fd_sc_hd__and4b_1": 1,
            "sky130_fd_sc_hd__buf_1": 8,
            "sky130_fd_sc_hd__buf_2": 9,
            "sky130_fd_sc_hd__buf_4": 82,
            "sky130_fd_sc_hd__buf_6": 1,
            "sky130_fd_sc_hd__clkbuf_1": 23,
            "sky130_fd_sc_hd__conb_1": 2,
            "sky130_fd_sc_hd__dfxtp_1": 165,
            "sky130_fd_sc_hd__inv_1": 19,
            "sky130_fd_sc_hd__mux2_2": 14,
            "sky130_fd_sc_hd__mux2_4": 27,
            "sky130_fd_sc_hd__mux2i_1": 45,
            "sky130_fd_sc_hd__mux4_2": 1,
            "sky130_fd_sc_hd__nand2_1": 68,
            "sky130_fd_sc_hd__nand2_2": 1,
            "sky130_fd_sc_hd__nand2b_1": 10,
            "sky130_fd_sc_hd__nand3_1": 13,
            "sky130_fd_sc_hd__nand3_4": 1,
            "sky130_fd_sc_hd__nand3b_1": 1,
            "sky130_fd_sc_hd__nand4_1": 2,
            "sky130_fd_sc_hd__nor2_1": 80,
            "sky130_fd_sc_hd__nor2_2": 1,
            "sky130_fd_sc_hd__nor2b_1": 7,
            "sky130_fd_sc_hd__nor3_1": 12,
            "sky130_fd_sc_hd__nor3_2": 2,
            "sky130_fd_sc_hd__nor3b_1": 1,
            "sky130_fd_sc_hd__nor4_1": 2,
            "sky130_fd_sc_hd__nor4_2": 1,
            "sky130_fd_sc_hd__nor4b_1": 2,
            "sky130_fd_sc_hd__o211a_1": 2,
            "sky130_fd_sc_hd__o211ai_1": 4,
            "sky130_fd_sc_hd__o21a_1": 3,
            "sky130_fd_sc_hd__o21ai_0": 51,
            "sky130_fd_sc_hd__o21ai_1": 1,
            "sky130_fd_sc_hd__o21ba_1": 1,
            "sky130_fd_sc_hd__o21bai_1": 2,
            "sky130_fd_sc_hd__o221ai_1": 2,
            "sky130_fd_sc_hd__o22ai_1": 2,
            "sky130_fd_sc_hd__o311ai_0": 1,
            "sky130_fd_sc_hd__o311ai_2": 1,
            "sky130_fd_sc_hd__o31a_1": 1,
            "sky130_fd_sc_hd__o31ai_1": 2,
            "sky130_fd_sc_hd__o31ai_2": 1,
            "sky130_fd_sc_hd__o32ai_1": 1,
            "sky130_fd_sc_hd__o41ai_1": 1,
            "sky130_fd_sc_hd__o41ai_2": 2,
            "sky130_fd_sc_hd__or2_1": 3,
            "sky130_fd_sc_hd__or3_1": 3,
            "sky130_fd_sc_hd__or4_1": 3,
            "sky130_fd_sc_hd__xnor2_1": 5,
            "sky130_fd_sc_hd__xnor3_1": 1,
            "sky130_fd_sc_hd__xor2_1": 5
         }
      }
   },
      "design": {
         "num_wires":         679,
         "num_wire_bits":     952,
         "num_pub_wires":     109,
         "num_pub_wire_bits": 382,
         "num_memories":      0,
         "num_memory_bits":   0,
         "num_processes":     0,
         "num_cells":         847,
         "area":              7822.502400,
         "num_cells_by_type": {
            "sky130_fd_sc_hd__a2111oi_0": 1,
            "sky130_fd_sc_hd__a211o_1": 1,
            "sky130_fd_sc_hd__a211oi_1": 10,
            "sky130_fd_sc_hd__a21boi_0": 2,
            "sky130_fd_sc_hd__a21o_1": 7,
            "sky130_fd_sc_hd__a21oi_1": 58,
            "sky130_fd_sc_hd__a221o_1": 7,
            "sky130_fd_sc_hd__a221oi_1": 2,
            "sky130_fd_sc_hd__a22o_1": 32,
            "sky130_fd_sc_hd__a22oi_1": 3,
            "sky130_fd_sc_hd__a31o_1": 1,
            "sky130_fd_sc_hd__a31oi_1": 3,
            "sky130_fd_sc_hd__a32o_1": 2,
            "sky130_fd_sc_hd__a32oi_1": 2,
            "sky130_fd_sc_hd__a41oi_1": 1,
            "sky130_fd_sc_hd__and2_0": 3,
            "sky130_fd_sc_hd__and2_1": 3,
            "sky130_fd_sc_hd__and3_1": 4,
            "sky130_fd_sc_hd__and3b_1": 5,
            "sky130_fd_sc_hd__and4_1": 1,
            "sky130_fd_sc_hd__and4b_1": 1,
            "sky130_fd_sc_hd__buf_1": 8,
            "sky130_fd_sc_hd__buf_2": 9,
            "sky130_fd_sc_hd__buf_4": 82,
            "sky130_fd_sc_hd__buf_6": 1,
            "sky130_fd_sc_hd__clkbuf_1": 23,
            "sky130_fd_sc_hd__conb_1": 2,
            "sky130_fd_sc_hd__dfxtp_1": 165,
            "sky130_fd_sc_hd__inv_1": 19,
            "sky130_fd_sc_hd__mux2_2": 14,
            "sky130_fd_sc_hd__mux2_4": 27,
            "sky130_fd_sc_hd__mux2i_1": 45,
            "sky130_fd_sc_hd__mux4_2": 1,
            "sky130_fd_sc_hd__nand2_1": 68,
            "sky130_fd_sc_hd__nand2_2": 1,
            "sky130_fd_sc_hd__nand2b_1": 10,
            "sky130_fd_sc_hd__nand3_1": 13,
            "sky130_fd_sc_hd__nand3_4": 1,
            "sky130_fd_sc_hd__nand3b_1": 1,
            "sky130_fd_sc_hd__nand4_1": 2,
            "sky130_fd_sc_hd__nor2_1": 80,
            "sky130_fd_sc_hd__nor2_2": 1,
            "sky130_fd_sc_hd__nor2b_1": 7,
            "sky130_fd_sc_hd__nor3_1": 12,
            "sky130_fd_sc_hd__nor3_2": 2,
            "sky130_fd_sc_hd__nor3b_1": 1,
            "sky130_fd_sc_hd__nor4_1": 2,
            "sky130_fd_sc_hd__nor4_2": 1,
            "sky130_fd_sc_hd__nor4b_1": 2,
            "sky130_fd_sc_hd__o211a_1": 2,
            "sky130_fd_sc_hd__o211ai_1": 4,
            "sky130_fd_sc_hd__o21a_1": 3,
            "sky130_fd_sc_hd__o21ai_0": 51,
            "sky130_fd_sc_hd__o21ai_1": 1,
            "sky130_fd_sc_hd__o21ba_1": 1,
            "sky130_fd_sc_hd__o21bai_1": 2,
            "sky130_fd_sc_hd__o221ai_1": 2,
            "sky130_fd_sc_hd__o22ai_1": 2,
            "sky130_fd_sc_hd__o311ai_0": 1,
            "sky130_fd_sc_hd__o311ai_2": 1,
            "sky130_fd_sc_hd__o31a_1": 1,
            "sky130_fd_sc_hd__o31ai_1": 2,
            "sky130_fd_sc_hd__o31ai_2": 1,
            "sky130_fd_sc_hd__o32ai_1": 1,
            "sky130_fd_sc_hd__o41ai_1": 1,
            "sky130_fd_sc_hd__o41ai_2": 2,
            "sky130_fd_sc_hd__or2_1": 3,
            "sky130_fd_sc_hd__or3_1": 3,
            "sky130_fd_sc_hd__or4_1": 3,
            "sky130_fd_sc_hd__xnor2_1": 5,
            "sky130_fd_sc_hd__xnor3_1": 1,
            "sky130_fd_sc_hd__xor2_1": 5
         }
      }
}

7822
echo on

yosys> log SC_METRIC: area: 7822

SC_METRIC: area: 7822


yosys> write_verilog -noattr -noexpr -nohex -nodec outputs/serv_top.vg

18. Executing Verilog backend.

yosys> clean_zerowidth
Dumping module `\serv_top'.

Warnings: 26 unique messages, 234 total
End of script. Logfile hash: 49cb0ac818, CPU: user 4.04s system 0.19s, MEM: 70.75 MB peak
Yosys 0.27+22 (git sha1 53c0a6b78, clang 10.0.0-4ubuntu1 -fPIC -Os)
Time spent: 23% 2x abc (1 sec), 15% 2x stat (0 sec), ...
